---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RegenFailures
source: html/c7726de2-e4f0-8861-8115-0ef9de7935b1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures

Failures about RegenFailures.

## Syntax (C#)
```csharp
public static class RegenFailures
```